Sudoku.org
#+TITLE: Solving Sudoku with Dancing Links
#+OPTIONS: num:nil
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="org-overrides.css" />
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="sudokuBoards.css" />

* Introduction

  In trying to implement Knuth's Dancing Links technique against the
  $N$-Queens problem, I also found that he used the DLX algorithm to
  solve Sudoku puzzles for a [[http://spivey.oriel.ox.ac.uk/mike/comp2005/results.html][programming contest]] in 2005.

* Sudoku

  #+begin_export html
    <div id="figure1" style="float:right; margin-left: 1em;">
    .2.......
    ...6....3
    .74.8....
    .....3..2
    .8..4..1.
    6..5.....
    ....1.78.
    5....9...
    .......4.
    </div>
  #+end_export

  Basics of the game can be found on any number of web pages.  Simply
  stated, you have a $9 \times 9$ grid of numbers broken into $3$
  groups of $3 \times 3$ grids.  In each row, column, and group each
  of the numbers $1$ through $9$ can only appear once.

  For display, this is often shown as a basic table such as this one
  to the right.  Again, for a full description of the various parts of
  the game, just seek the internet.

  I will note that I have chosen to use the string representation of
  boards from the 2005 contest.  Such that the board above is
  represented as the following string.

  #+begin_example
.2.......
...6....3
.74.8....
.....3..2
.8..4..1.
6..5.....
....1.78.
5....9...
.......4.
  #+end_example

* As an exact cover problem.

  In order to use the DLX algorithm, we must recast this problem to be
  one of selecting all rows of a matrix where there is a single $1$
  per column.  To achieve this, we will make a new matrix where each
  column represents a number being placed in any of the $9 \times 9$
  positions, then each of the possible numbers per rows, column, and
  group.  This brings us to $9 \times 9 + 9 \times 9 + 9 \times 9 + 9
  \times 9 = 324$ columns of the matrix.

  What, then, are the rows?  They are simply a $1$ in each of the
  columns that specify a) which position of the board the number is
  in, b) what column and number are used, c) what row and number are
  used, and d) what group and number are used.  Note that for b, c,
  and d, we will have the same "number" per column.  That is, if it is
  covering $C_{x3}$, it will also be covering $R_{x3}$ and $G_{x3}$.
  It will *not* necessarily be covering $P_{x3}$.

  Regardless, this gives us a maximum of $positions \times digits = (9
  \times 9) \times 9 = 729$ rows.  In reality, when we are solving a
  particular puzzle, we will have much fewer rows.  We will also have
  fewer columns, though not by as large of a factor.

* DLX Sudoku Solver

  Now then, we need to briefly make a sudoku solver that can output
  solutions we can then display.  I confess I should have done the
  $N$-Queens solution in a more generic fashion such that I could just
  reference the dancing links algorithm.  Indeed, Knuth's
  implementation of DLX is available such that you can simply pipe it
  the columns to cover, then all of the rows.

  Unfortunately, I did not do that.  So, we'll be doing all of that
  again here.  (I may clean this up some day such that I am doing that.)

** Outline

   The basic outline of our Sudoku solver is here.

   #+name: dlx_sudoku_solver
   #+BEGIN_SRC js :tangle dlxSudokuSolver.js :comments noweb :noweb tangle
     function dlxSudokuSolver(strings, showSteps) {
         var headers, solutions = [], O = [];

             <<dlx_search>>

             <<dlx_cover_uncover>>

             <<dlx_utilities>>

             <<dlx_initialize_headers>>


         initializeHeaders();
         search(0);
         return solutions;
     }
   #+END_SRC

