Sudoku.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-02-05 Fri 23:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Solving Sudoku with Dancing Links</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Josh Berry" />
<link rel="stylesheet" type="text/css" href="org-overrides.css" />
<link rel="stylesheet" type="text/css" href="sudokuBoards.css" />
</head>
<body>
<div id="content">
<h1 class="title">Solving Sudoku with Dancing Links</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6d25fb8">Introduction</a></li>
<li><a href="#orgd39659f">Sudoku</a></li>
<li><a href="#org675af9b">As an exact cover problem.</a></li>
<li><a href="#orge4ea7ad">DLX Sudoku Solver</a>
<ul>
<li><a href="#org04f9521">Outline</a></li>
<li><a href="#orge25d4d9">DLX core</a></li>
<li><a href="#org037268d">Making the columns for Sudoku</a>
<ul>
<li><a href="#org161cf87">Outline</a></li>
<li><a href="#org4b1094b">Needed variables</a></li>
<li><a href="#org582575e">Methods to create headers and cells.</a></li>
<li><a href="#org88f63ad">Initialize Data</a></li>
<li><a href="#org4915e46">Read in board data.</a></li>
<li><a href="#org6e47801">Generate Headers</a></li>
<li><a href="#orga671c4a">Generate Rows</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb21192a">Seeing it work</a></li>
<li><a href="#org71ca855">Appendix</a>
<ul>
<li><a href="#orgc187904">Javascript used to make boards</a></li>
<li><a href="#org90222b2">Styles used.</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org6d25fb8" class="outline-2">
<h2 id="org6d25fb8">Introduction</h2>
<div class="outline-text-2" id="text-org6d25fb8">
<p>
In trying to implement Knuth's Dancing Links technique against the
$N$-Queens problem, I also found that he used the DLX algorithm to
solve Sudoku puzzles for a <a href="http://spivey.oriel.ox.ac.uk/mike/comp2005/results.html">programming contest</a> in 2005.
</p>
</div>
</div>

<div id="outline-container-orgd39659f" class="outline-2">
<h2 id="orgd39659f">Sudoku</h2>
<div class="outline-text-2" id="text-orgd39659f">
<div id="figure1" style="float:right; margin-left: 1em;">
.2.......
...6....3
.74.8....
.....3..2
.8..4..1.
6..5.....
....1.78.
5....9...
.......4.
</div>

<p>
Basics of the game can be found on any number of web pages.  Simply
stated, you have a \(9 \times 9\) grid of numbers broken into \(3\)
groups of \(3 \times 3\) grids.  In each row, column, and group each
of the numbers \(1\) through \(9\) can only appear once.
</p>

<p>
For display, this is often shown as a basic table such as this one
to the right.  Again, for a full description of the various parts of
the game, just seek the internet.
</p>

<p>
I will note that I have chosen to use the string representation of
boards from the 2005 contest.  Such that the board above is
represented as the following string.
</p>

<pre class="example" id="org0147b3c">
.2.......
...6....3
.74.8....
.....3..2
.8..4..1.
6..5.....
....1.78.
5....9...
.......4.
</pre>
</div>
</div>

<div id="outline-container-org675af9b" class="outline-2">
<h2 id="org675af9b">As an exact cover problem.</h2>
<div class="outline-text-2" id="text-org675af9b">
<p>
In order to use the DLX algorithm, we must recast this problem to be
one of selecting all rows of a matrix where there is a single \(1\)
per column.  To achieve this, we will make a new matrix where each
column represents a number being placed in any of the \(9 \times 9\)
positions, then each of the possible numbers per rows, column, and
group.  This brings us to \(9 \times 9 + 9 \times 9 + 9 \times 9 + 9
  \times 9 = 324\) columns of the matrix.
</p>

<p>
What, then, are the rows?  They are simply a \(1\) in each of the
columns that specify a) which position of the board the number is
in, b) what column and number are used, c) what row and number are
used, and d) what group and number are used.  Note that for b, c,
and d, we will have the same "number" per column.  That is, if it is
covering \(C_{x3}\), it will also be covering \(R_{x3}\) and \(G_{x3}\).
It will <b>not</b> necessarily be covering \(P_{x3}\).
</p>

<p>
Regardless, this gives us a maximum of \(positions \times digits = (9
  \times 9) \times 9 = 729\) rows.  In reality, when we are solving a
particular puzzle, we will have much fewer rows.  We will also have
fewer columns, though not by as large of a factor.
</p>
</div>
</div>

<div id="outline-container-orge4ea7ad" class="outline-2">
<h2 id="orge4ea7ad">DLX Sudoku Solver</h2>
<div class="outline-text-2" id="text-orge4ea7ad">
<p>
Now then, we need to briefly make a sudoku solver that can output
solutions we can then display.  I confess I should have done the
$N$-Queens solution in a more generic fashion such that I could just
reference the dancing links algorithm.  Indeed, Knuth's
implementation of DLX is available such that you can simply pipe it
the columns to cover, then all of the rows.
</p>

<p>
Unfortunately, I did not do that.  So, we'll be doing all of that
again here.  (I may clean this up some day such that I am doing that.)
</p>
</div>

<div id="outline-container-org04f9521" class="outline-3">
<h3 id="org04f9521">Outline</h3>
<div class="outline-text-3" id="text-org04f9521">
<p>
The basic outline of our Sudoku solver is here.
</p>

<div class="org-src-container">
<pre class="src src-js" id="orgc0e4e4b"><span style="color: #F0DFAF; font-weight: bold;">function</span> <span style="color: #93E0E3;">dlxSudokuSolver</span>(<span style="color: #DFAF8F;">strings</span>, <span style="color: #DFAF8F;">showSteps</span>) {
    <span style="color: #F0DFAF; font-weight: bold;">var</span> <span style="color: #DFAF8F;">headers</span>, <span style="color: #DFAF8F;">solutions</span> = [], <span style="color: #DFAF8F;">O</span> = [];

        &lt;&lt;dlx_search&gt;&gt;

        &lt;&lt;dlx_cover_uncover&gt;&gt;

        &lt;&lt;dlx_utilities&gt;&gt;

        &lt;&lt;dlx_initialize_headers&gt;&gt;


    initializeHeaders();
    search(0);
    <span style="color: #F0DFAF; font-weight: bold;">return</span> solutions;
}
</pre>
</div>
</div>
</div>
