Sudoku.org
** DLX core

   The search, covering/uncovering, and utilities code is basically
   unmodified from the code used in my [[file:DancingLinks.org][$N$-Queens]] exploration.  See
   there for more of an explanation.  I could abstract out the DLX
   portion to its own javascript function.  For now, though, this is
   just a copy paste of the previous version I used.

   #+name: dlx_search
   #+begin_src js
     function search(k) {
         var c, r;
         if (headers.right === headers) {
             solutions.push(copySolution());
             return;
         }
         if (showSteps) {
             solutions.push(copySolution());
         }
         c = smallestColumn();
         cover(c);
         r = c.down;
         while (r !== c) {
             O.push(printRow(r));
             r = r.right;
             while (r.col !== c) {
                 cover(r.col);
                 r = r.right;
             }
             search(k + 1);
             r = r.left;
             while (r.col !== c) {
                 uncover(r.col);
                 r = r.left;
             }
             r = r.down;
             O.pop();
         }
         uncover(c);
     }
   #+end_src

   #+name: dlx_cover_uncover
   #+begin_src js
     function cover(c) {
         var r = c.down;
         c.right.left = c.left;
         c.left.right = c.right;
         while (r !== c) {
             r = r.right;
             while (r.col !== c) {
                 r.up.down = r.down;
                 r.down.up = r.up;
                 r.col.size--;
                 r = r.right;
             }
             r = r.down;
         }
     }

     function uncover(c) {
         var r = c.up;
         c.right.left = c;
         c.left.right = c;
         while (r !== c) {
             r = r.left;
             while (r.col !== c) {
                 r.up.down = r;
                 r.down.up = r;
                 r.col.size++;
                 r = r.left;
             }
             r = r.up;
         }
     }
   #+end_src

   #+name: dlx_utilities
   #+begin_src js
     function smallestColumn() {
         var h, c, s = Number.MAX_VALUE;
         h = headers.right;
         while (h !== headers) {
             if (h.size < s) {
                 c = h;
                 s = c.size;
             }
             h = h.right;
         }
         return c;
     }
     function printRow(r) {
         var s = r.col.name + ' ', e = r;
         r = r.right;
         while (r !== e) {
             s += r.col.name + ' ';
             r = r.right;
         }
         return s;
     }
     function copySolution() {
         var solution = [].concat(O);
         return solution;
     }

   #+end_src


** Making the columns for Sudoku

   Our logic for generating the columns and rows to represent the
   sudoku board is actually a bit larger than the code to do the
   actual search.  Amusingly, having looked at Knuth's code, I do
   think things would be simpler if I focused on making the code such
   that this was only responsible for naming the headers and rows.
   Regardless, I had already written this when that was evident.


*** Outline

    Our method, then will have the following outline.

    #+NAME: dlx_initialize_headers
    #+BEGIN_SRC js :noweb tangle :comments noweb
      function initializeHeaders() {
              <<variables_needed_for_headers>>

              <<methods_to_create_headers_and_cells>>

              <<initialize_data>>

              <<read_in_data>>

              <<generate_headers>>

              <<generate_rows>>
      }
    #+END_SRC

*** Needed variables

    Where are required variables are relatively straight forward.  For
    book keeping, we keep a tally of each digit seen in a
    row/col/group, and each overall position that has seen a value.
    We will also need up to three basic index variables.

    #+NAME: variables_needed_for_headers
    #+BEGIN_SRC js
      var rows = [],
          cols = [],
          grps = [],
          positions = [],
          rawHeaders = [],
          rawRows = [],
          i, j, k;
    #+END_SRC

*** Methods to create headers and cells.

    Since we don't have structs in javascript, I just use a couple of
    methods to make what we need for headers and cells.

    #+NAME: methods_to_create_headers_and_cells
    #+BEGIN_SRC js
      function header(name) {
          var h = {
              name: name,
              up: null,
              down: null,
              left: null,
              right: null,
              size: 0
          };
          h.up = h;
          h.down = h;
          return h;
      }
      function cell(colName) {
          var newCell = {
              up: null,
              down: null,
              left: null,
              right: null,
              col: null
          },
              col = rawHeaders[0];

          while (col.name !== colName)
              col = col.right;

          col.size++;
          newCell.down = col;
          newCell.up = col.up;
          newCell.down.up = newCell;
          newCell.up.down = newCell;
          newCell.col = col;
          return newCell;
      }
    #+END_SRC

*** Initialize Data

    To determine which rows and columns need covering, we will first
    mark off which rows and columns have data.  I'll begin by making
    basic boolean arrays for each digit of each row/col/group and each
    position.

    #+NAME: initialize_data
    #+BEGIN_SRC js
      for (i = 0; i < 9; i++) {
          rows[i] = [];
          cols[i] = [];
          grps[i] = [];
          positions[i] = [];
          for (j = 0; j < 9; j++) {
              rows[i][j] = 0;
              cols[i][j] = 0;
              grps[i][j] = 0;
              positions[i][j] = 0;
          }
      }

    #+END_SRC

