Sudoku.html

<div id="outline-container-orge25d4d9" class="outline-3">
<h3 id="orge25d4d9">DLX core</h3>
<div class="outline-text-3" id="text-orge25d4d9">
<p>
The search, covering/uncovering, and utilities code is basically
unmodified from the code used in my <a href="DancingLinks.html">$N$-Queens</a> exploration.  See
there for more of an explanation.  I could abstract out the DLX
portion to its own javascript function.  For now, though, this is
just a copy paste of the previous version I used.
</p>

<div class="org-src-container">
<pre class="src src-js" id="orgf066fad"><span style="color: #F0DFAF; font-weight: bold;">function</span> <span style="color: #93E0E3;">search</span>(<span style="color: #DFAF8F;">k</span>) {
    <span style="color: #F0DFAF; font-weight: bold;">var</span> <span style="color: #DFAF8F;">c</span>, <span style="color: #DFAF8F;">r</span>;
    <span style="color: #F0DFAF; font-weight: bold;">if</span> (headers.right === headers) {
        solutions.push(copySolution());
        <span style="color: #F0DFAF; font-weight: bold;">return</span>;
    }
    <span style="color: #F0DFAF; font-weight: bold;">if</span> (showSteps) {
        solutions.push(copySolution());
    }
    c = smallestColumn();
    cover(c);
    r = c.down;
    <span style="color: #F0DFAF; font-weight: bold;">while</span> (r !== c) {
        O.push(printRow(r));
        r = r.right;
        <span style="color: #F0DFAF; font-weight: bold;">while</span> (r.col !== c) {
            cover(r.col);
            r = r.right;
        }
        search(k + 1);
        r = r.left;
        <span style="color: #F0DFAF; font-weight: bold;">while</span> (r.col !== c) {
            uncover(r.col);
            r = r.left;
        }
        r = r.down;
        O.pop();
    }
    uncover(c);
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-js" id="org7c18226"><span style="color: #F0DFAF; font-weight: bold;">function</span> <span style="color: #93E0E3;">cover</span>(<span style="color: #DFAF8F;">c</span>) {
    <span style="color: #F0DFAF; font-weight: bold;">var</span> <span style="color: #DFAF8F;">r</span> = c.down;
    c.right.left = c.left;
    c.left.right = c.right;
    <span style="color: #F0DFAF; font-weight: bold;">while</span> (r !== c) {
        r = r.right;
        <span style="color: #F0DFAF; font-weight: bold;">while</span> (r.col !== c) {
            r.up.down = r.down;
            r.down.up = r.up;
            r.col.size--;
            r = r.right;
        }
        r = r.down;
    }
}

<span style="color: #F0DFAF; font-weight: bold;">function</span> <span style="color: #93E0E3;">uncover</span>(<span style="color: #DFAF8F;">c</span>) {
    <span style="color: #F0DFAF; font-weight: bold;">var</span> <span style="color: #DFAF8F;">r</span> = c.up;
    c.right.left = c;
    c.left.right = c;
    <span style="color: #F0DFAF; font-weight: bold;">while</span> (r !== c) {
        r = r.left;
        <span style="color: #F0DFAF; font-weight: bold;">while</span> (r.col !== c) {
            r.up.down = r;
            r.down.up = r;
            r.col.size++;
            r = r.left;
        }
        r = r.up;
    }
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-js" id="orgfa27422"><span style="color: #F0DFAF; font-weight: bold;">function</span> <span style="color: #93E0E3;">smallestColumn</span>() {
    <span style="color: #F0DFAF; font-weight: bold;">var</span> <span style="color: #DFAF8F;">h</span>, <span style="color: #DFAF8F;">c</span>, <span style="color: #DFAF8F;">s</span> = Number.MAX_VALUE;
    h = headers.right;
    <span style="color: #F0DFAF; font-weight: bold;">while</span> (h !== headers) {
        <span style="color: #F0DFAF; font-weight: bold;">if</span> (h.size &lt; s) {
            c = h;
            s = c.size;
        }
        h = h.right;
    }
    <span style="color: #F0DFAF; font-weight: bold;">return</span> c;
}
<span style="color: #F0DFAF; font-weight: bold;">function</span> <span style="color: #93E0E3;">printRow</span>(<span style="color: #DFAF8F;">r</span>) {
    <span style="color: #F0DFAF; font-weight: bold;">var</span> <span style="color: #DFAF8F;">s</span> = r.col.name + <span style="color: #CC9393;">' '</span>, <span style="color: #DFAF8F;">e</span> = r;
    r = r.right;
    <span style="color: #F0DFAF; font-weight: bold;">while</span> (r !== e) {
        s += r.col.name + <span style="color: #CC9393;">' '</span>;
        r = r.right;
    }
    <span style="color: #F0DFAF; font-weight: bold;">return</span> s;
}
<span style="color: #F0DFAF; font-weight: bold;">function</span> <span style="color: #93E0E3;">copySolution</span>() {
    <span style="color: #F0DFAF; font-weight: bold;">var</span> <span style="color: #DFAF8F;">solution</span> = [].concat(O);
    <span style="color: #F0DFAF; font-weight: bold;">return</span> solution;
}

</pre>
</div>
</div>
</div>


<div id="outline-container-org037268d" class="outline-3">
<h3 id="org037268d">Making the columns for Sudoku</h3>
<div class="outline-text-3" id="text-org037268d">
<p>
Our logic for generating the columns and rows to represent the
sudoku board is actually a bit larger than the code to do the
actual search.  Amusingly, having looked at Knuth's code, I do
think things would be simpler if I focused on making the code such
that this was only responsible for naming the headers and rows.
Regardless, I had already written this when that was evident.
</p>
</div>


<div id="outline-container-org161cf87" class="outline-4">
<h4 id="org161cf87">Outline</h4>
<div class="outline-text-4" id="text-org161cf87">
<p>
Our method, then will have the following outline.
</p>

<div class="org-src-container">
<pre class="src src-js" id="orga46fef2"><span style="color: #F0DFAF; font-weight: bold;">function</span> <span style="color: #93E0E3;">initializeHeaders</span>() {
        &lt;&lt;variables_needed_for_headers&gt;&gt;

        &lt;&lt;methods_to_create_headers_and_cells&gt;&gt;

        &lt;&lt;initialize_data&gt;&gt;

        &lt;&lt;read_in_data&gt;&gt;

        &lt;&lt;generate_headers&gt;&gt;

        &lt;&lt;generate_rows&gt;&gt;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org4b1094b" class="outline-4">
<h4 id="org4b1094b">Needed variables</h4>
<div class="outline-text-4" id="text-org4b1094b">
<p>
Where are required variables are relatively straight forward.  For
book keeping, we keep a tally of each digit seen in a
row/col/group, and each overall position that has seen a value.
We will also need up to three basic index variables.
</p>

<div class="org-src-container">
<pre class="src src-js" id="org1d6ee5e"><span style="color: #F0DFAF; font-weight: bold;">var</span> <span style="color: #DFAF8F;">rows</span> = [],
    cols = [],
    grps = [],
    positions = [],
    rawHeaders = [],
    rawRows = [],
    i, j, k;
</pre>
</div>
</div>
</div>

<div id="outline-container-org582575e" class="outline-4">
<h4 id="org582575e">Methods to create headers and cells.</h4>
<div class="outline-text-4" id="text-org582575e">
<p>
Since we don't have structs in javascript, I just use a couple of
methods to make what we need for headers and cells.
</p>

<div class="org-src-container">
<pre class="src src-js" id="orgb5594bb"><span style="color: #F0DFAF; font-weight: bold;">function</span> <span style="color: #93E0E3;">header</span>(<span style="color: #DFAF8F;">name</span>) {
    <span style="color: #F0DFAF; font-weight: bold;">var</span> <span style="color: #DFAF8F;">h</span> = {
        name: name,
        up: <span style="color: #BFEBBF;">null</span>,
        down: <span style="color: #BFEBBF;">null</span>,
        left: <span style="color: #BFEBBF;">null</span>,
        right: <span style="color: #BFEBBF;">null</span>,
        size: 0
    };
    h.up = h;
    h.down = h;
    <span style="color: #F0DFAF; font-weight: bold;">return</span> h;
}
<span style="color: #F0DFAF; font-weight: bold;">function</span> <span style="color: #93E0E3;">cell</span>(<span style="color: #DFAF8F;">colName</span>) {
    <span style="color: #F0DFAF; font-weight: bold;">var</span> <span style="color: #DFAF8F;">newCell</span> = {
        up: <span style="color: #BFEBBF;">null</span>,
        down: <span style="color: #BFEBBF;">null</span>,
        left: <span style="color: #BFEBBF;">null</span>,
        right: <span style="color: #BFEBBF;">null</span>,
        col: <span style="color: #BFEBBF;">null</span>
    },
        col = rawHeaders[0];

    <span style="color: #F0DFAF; font-weight: bold;">while</span> (col.name !== colName)
        col = col.right;

    col.size++;
    newCell.down = col;
    newCell.up = col.up;
    newCell.down.up = newCell;
    newCell.up.down = newCell;
    newCell.col = col;
    <span style="color: #F0DFAF; font-weight: bold;">return</span> newCell;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org88f63ad" class="outline-4">
<h4 id="org88f63ad">Initialize Data</h4>
<div class="outline-text-4" id="text-org88f63ad">
<p>
To determine which rows and columns need covering, we will first
mark off which rows and columns have data.  I'll begin by making
basic boolean arrays for each digit of each row/col/group and each
position.
</p>

<div class="org-src-container">
<pre class="src src-js" id="org225dfef"><span style="color: #F0DFAF; font-weight: bold;">for</span> (i = 0; i &lt; 9; i++) {
    rows[i] = [];
    cols[i] = [];
    grps[i] = [];
    positions[i] = [];
    <span style="color: #F0DFAF; font-weight: bold;">for</span> (j = 0; j &lt; 9; j++) {
        rows[i][j] = 0;
        cols[i][j] = 0;
        grps[i][j] = 0;
        positions[i][j] = 0;
    }
}

</pre>
</div>
</div>
</div>
