Sudoku.org
*** Read in board data.

    The only real trick going on here is that I reduce curValue by
    one.  This is as much from laziness on my part as it is anything
    else.  For some reason, having the zero element of each array be
    worthless bothered me at first.  I changed my mind later, but this
    was already working.

    #+NAME: read_in_data
    #+BEGIN_SRC js
      for (i = 0; i < 9; i++) {
          for (j = 0; j < 9; j++) {
              var curValue = strings[i].charAt(j);
              if (curValue && curValue !== '.') {
                  curValue--;
                  var g = Math.floor(i/3)*3 + Math.floor(j/3);
                  if (rows[i][curValue]) throw "Duplicate values in row";
                  if (cols[j][curValue]) throw "Duplicate values in col";
                  if (grps[g][curValue]) throw "Duplicate values in group.";
                  rows[i][curValue] = 1;
                  cols[j][curValue] = 1;
                  grps[g][curValue] = 1;
                  positions[i][j] = 1;
              }
          }
      }

    #+END_SRC

*** Generate Headers

    I do this in two passes, as it was cumbersome to do it in one.

    #+NAME: generate_headers
    #+BEGIN_SRC js
      rawHeaders.push(header("root"));
      for (i = 0; i < 9; i++) {
          for (j = 0; j < 9; j++) {
              if (!positions[i][j]) {
                  rawHeaders.push(header("p"+i.toString()+j.toString()));
              }
          }
      }
      for (i = 0; i < 9; i++) {
          for (k = 0; k < 9; k++) {
              if (!rows[i][k])
                  rawHeaders.push(header("r"+i.toString()+k.toString()));
              if (!cols[i][k])
                  rawHeaders.push(header("c"+i.toString()+k.toString()));
              if (!grps[i][k])
                  rawHeaders.push(header("g"+i.toString()+k.toString()));
          }
      }

      //Now, link them up.
      for (i = 1; i < rawHeaders.length; i++) {
          var h = rawHeaders[i];
          h.left = rawHeaders[i-1];
          rawHeaders[i - 1].right = h;
      }
      rawHeaders[0].left = rawHeaders[rawHeaders.length - 1];
      rawHeaders[rawHeaders.length - 1].right = rawHeaders[0];
      headers = rawHeaders[0];
    #+END_SRC

*** Generate Rows

    Similarly to the headers, I first generate all of the row cells,
    and then I link them up to their left/right values.  Is a little
    trickier here, but nothing terribly fancy.

    #+NAME: generate_rows
    #+BEGIN_SRC js
      for (i = 0; i < 9; i++) {
          var x = Math.floor(i/3) * 3;
          for (j = 0; j < 9; j++) {
              if (!positions[i][j]) {
                  var g = x + Math.floor(j/3);
                  for (k = 0; k < 9; k++) {
                      if (!rows[i][k] && !cols[j][k] && !grps[g][k]) {
                          rawRows.push(cell("p"+i.toString()+j.toString()));
                          rawRows.push(cell("r"+i.toString()+k.toString()));
                          rawRows.push(cell("c"+j.toString()+k.toString()));
                          rawRows.push(cell("g"+g.toString()+k.toString()));
                      }
                  }
              }
          }
      }

      //Now, link up the rows.  (Cheating, and simply linking up all groups of 4.)
      for (i = 0; i < rawRows.length; i+=4) {
          var a = rawRows[i],
              b = rawRows[i+1],
              c = rawRows[i+2],
              d = rawRows[i+3];
          a.right = b;
          b.right = c;
          c.right = d;
          d.right = a;
          a.left = d;
          b.left = a;
          c.left = b;
          d.left = c;
      }
    #+END_SRC

* Seeing it work

  And, below is a quick view of the states that the algorithm looks at
  for the configuration originally given.  If you want to see it
  actually get the solution, from 927 to 978 is the final run.  After
  that, it is the algorithm simply looking for any more solutions.

  Also, I should probably add something to the algorithm to stop after
  finding $N$ solutions, as otherwise it takes bloody forever on some
  initial configurations.

  Finally, I definitely need to add something showing why it decides
  to backtrack.  I can not tell from position 27 to 28 exactly where
  there were no choices available.  :(

  #+begin_export html
    <div id="figure2" style="text-align: center;">
.2.......
...6....3
.74.8....
.....3..2
.8..4..1.
6..5.....
....1.78.
5....9...
.......4.
    </div>
  #+end_export

* Appendix

