Sudoku.html

<div id="outline-container-org4915e46" class="outline-4">
<h4 id="org4915e46">Read in board data.</h4>
<div class="outline-text-4" id="text-org4915e46">
<p>
The only real trick going on here is that I reduce curValue by
one.  This is as much from laziness on my part as it is anything
else.  For some reason, having the zero element of each array be
worthless bothered me at first.  I changed my mind later, but this
was already working.
</p>

<div class="org-src-container">
<pre class="src src-js" id="orgbfaa206"><span style="color: #F0DFAF; font-weight: bold;">for</span> (i = 0; i &lt; 9; i++) {
    <span style="color: #F0DFAF; font-weight: bold;">for</span> (j = 0; j &lt; 9; j++) {
        <span style="color: #F0DFAF; font-weight: bold;">var</span> <span style="color: #DFAF8F;">curValue</span> = strings[i].charAt(j);
        <span style="color: #F0DFAF; font-weight: bold;">if</span> (curValue &amp;&amp; curValue !== <span style="color: #CC9393;">'.'</span>) {
            curValue--;
            <span style="color: #F0DFAF; font-weight: bold;">var</span> <span style="color: #DFAF8F;">g</span> = Math.floor(i/3)*3 + Math.floor(j/3);
            <span style="color: #F0DFAF; font-weight: bold;">if</span> (rows[i][curValue]) <span style="color: #F0DFAF; font-weight: bold;">throw</span> <span style="color: #CC9393;">"Duplicate values in row"</span>;
            <span style="color: #F0DFAF; font-weight: bold;">if</span> (cols[j][curValue]) <span style="color: #F0DFAF; font-weight: bold;">throw</span> <span style="color: #CC9393;">"Duplicate values in col"</span>;
            <span style="color: #F0DFAF; font-weight: bold;">if</span> (grps[g][curValue]) <span style="color: #F0DFAF; font-weight: bold;">throw</span> <span style="color: #CC9393;">"Duplicate values in group."</span>;
            rows[i][curValue] = 1;
            cols[j][curValue] = 1;
            grps[g][curValue] = 1;
            positions[i][j] = 1;
        }
    }
}

</pre>
</div>
</div>
</div>

<div id="outline-container-org6e47801" class="outline-4">
<h4 id="org6e47801">Generate Headers</h4>
<div class="outline-text-4" id="text-org6e47801">
<p>
I do this in two passes, as it was cumbersome to do it in one.
</p>

<div class="org-src-container">
<pre class="src src-js" id="org458e039">rawHeaders.push(header(<span style="color: #CC9393;">"root"</span>));
<span style="color: #F0DFAF; font-weight: bold;">for</span> (i = 0; i &lt; 9; i++) {
    <span style="color: #F0DFAF; font-weight: bold;">for</span> (j = 0; j &lt; 9; j++) {
        <span style="color: #F0DFAF; font-weight: bold;">if</span> (!positions[i][j]) {
            rawHeaders.push(header(<span style="color: #CC9393;">"p"</span>+i.toString()+j.toString()));
        }
    }
}
<span style="color: #F0DFAF; font-weight: bold;">for</span> (i = 0; i &lt; 9; i++) {
    <span style="color: #F0DFAF; font-weight: bold;">for</span> (k = 0; k &lt; 9; k++) {
        <span style="color: #F0DFAF; font-weight: bold;">if</span> (!rows[i][k])
            rawHeaders.push(header(<span style="color: #CC9393;">"r"</span>+i.toString()+k.toString()));
        <span style="color: #F0DFAF; font-weight: bold;">if</span> (!cols[i][k])
            rawHeaders.push(header(<span style="color: #CC9393;">"c"</span>+i.toString()+k.toString()));
        <span style="color: #F0DFAF; font-weight: bold;">if</span> (!grps[i][k])
            rawHeaders.push(header(<span style="color: #CC9393;">"g"</span>+i.toString()+k.toString()));
    }
}

<span style="color: #5F7F5F;">//</span><span style="color: #7F9F7F;">Now, link them up.</span>
<span style="color: #F0DFAF; font-weight: bold;">for</span> (i = 1; i &lt; rawHeaders.length; i++) {
    <span style="color: #F0DFAF; font-weight: bold;">var</span> <span style="color: #DFAF8F;">h</span> = rawHeaders[i];
    h.left = rawHeaders[i-1];
    rawHeaders[i - 1].right = h;
}
rawHeaders[0].left = rawHeaders[rawHeaders.length - 1];
rawHeaders[rawHeaders.length - 1].right = rawHeaders[0];
headers = rawHeaders[0];
</pre>
</div>
</div>
</div>

<div id="outline-container-orga671c4a" class="outline-4">
<h4 id="orga671c4a">Generate Rows</h4>
<div class="outline-text-4" id="text-orga671c4a">
<p>
Similarly to the headers, I first generate all of the row cells,
and then I link them up to their left/right values.  Is a little
trickier here, but nothing terribly fancy.
</p>

<div class="org-src-container">
<pre class="src src-js" id="orge45dd02"><span style="color: #F0DFAF; font-weight: bold;">for</span> (i = 0; i &lt; 9; i++) {
    <span style="color: #F0DFAF; font-weight: bold;">var</span> <span style="color: #DFAF8F;">x</span> = Math.floor(i/3) * 3;
    <span style="color: #F0DFAF; font-weight: bold;">for</span> (j = 0; j &lt; 9; j++) {
        <span style="color: #F0DFAF; font-weight: bold;">if</span> (!positions[i][j]) {
            <span style="color: #F0DFAF; font-weight: bold;">var</span> <span style="color: #DFAF8F;">g</span> = x + Math.floor(j/3);
            <span style="color: #F0DFAF; font-weight: bold;">for</span> (k = 0; k &lt; 9; k++) {
                <span style="color: #F0DFAF; font-weight: bold;">if</span> (!rows[i][k] &amp;&amp; !cols[j][k] &amp;&amp; !grps[g][k]) {
                    rawRows.push(cell(<span style="color: #CC9393;">"p"</span>+i.toString()+j.toString()));
                    rawRows.push(cell(<span style="color: #CC9393;">"r"</span>+i.toString()+k.toString()));
                    rawRows.push(cell(<span style="color: #CC9393;">"c"</span>+j.toString()+k.toString()));
                    rawRows.push(cell(<span style="color: #CC9393;">"g"</span>+g.toString()+k.toString()));
                }
            }
        }
    }
}

<span style="color: #5F7F5F;">//</span><span style="color: #7F9F7F;">Now, link up the rows.  (Cheating, and simply linking up all groups of 4.)</span>
<span style="color: #F0DFAF; font-weight: bold;">for</span> (i = 0; i &lt; rawRows.length; i+=4) {
    <span style="color: #F0DFAF; font-weight: bold;">var</span> <span style="color: #DFAF8F;">a</span> = rawRows[i],
        b = rawRows[i+1],
        c = rawRows[i+2],
        d = rawRows[i+3];
    a.right = b;
    b.right = c;
    c.right = d;
    d.right = a;
    a.left = d;
    b.left = a;
    c.left = b;
    d.left = c;
}
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb21192a" class="outline-2">
<h2 id="orgb21192a">Seeing it work</h2>
<div class="outline-text-2" id="text-orgb21192a">
<p>
And, below is a quick view of the states that the algorithm looks at
for the configuration originally given.  If you want to see it
actually get the solution, from 927 to 978 is the final run.  After
that, it is the algorithm simply looking for any more solutions.
</p>

<p>
Also, I should probably add something to the algorithm to stop after
finding \(N\) solutions, as otherwise it takes bloody forever on some
initial configurations.
</p>

<p>
Finally, I definitely need to add something showing why it decides
to backtrack.  I can not tell from position 27 to 28 exactly where
there were no choices available.  :(
</p>

    <div id="figure2" style="text-align: center;">
.2.......
...6....3
.74.8....
.....3..2
.8..4..1.
6..5.....
....1.78.
5....9...
.......4.
    </div>
</div>
</div>
