Sudoku.html

<div id="outline-container-org71ca855" class="outline-2">
<h2 id="org71ca855">Appendix</h2>
<div class="outline-text-2" id="text-org71ca855">
</div>
<div id="outline-container-orgc187904" class="outline-3">
<h3 id="orgc187904">Javascript used to make boards</h3>
<div class="outline-text-3" id="text-orgc187904">
<p>
Nothing too fancy here.  Could have pulled in a library, of course,
though that felt slightly overkill for my purposes.
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #F0DFAF; font-weight: bold;">function</span> <span style="color: #93E0E3;">element</span>(<span style="color: #DFAF8F;">name</span>, <span style="color: #DFAF8F;">children</span>) {
    <span style="color: #F0DFAF; font-weight: bold;">var</span> <span style="color: #DFAF8F;">el</span> = document.createElement(name), <span style="color: #DFAF8F;">i</span>;
    <span style="color: #F0DFAF; font-weight: bold;">if</span> (children) {
        <span style="color: #F0DFAF; font-weight: bold;">for</span>(i = 0; i &lt; children.length; i++) {
            <span style="color: #F0DFAF; font-weight: bold;">var</span> <span style="color: #DFAF8F;">child</span> = children[i];
            <span style="color: #F0DFAF; font-weight: bold;">if</span> (<span style="color: #F0DFAF; font-weight: bold;">typeof</span> child === <span style="color: #CC9393;">"string"</span>) {
                el.appendChild(document.createTextNode(child));
            } <span style="color: #F0DFAF; font-weight: bold;">else</span> {
                el.appendChild(child);
            }
        };
    }
    <span style="color: #F0DFAF; font-weight: bold;">return</span> el;
}
<span style="color: #F0DFAF; font-weight: bold;">function</span> <span style="color: #93E0E3;">div</span>()   { <span style="color: #F0DFAF; font-weight: bold;">return</span> element(<span style="color: #CC9393;">"div"</span>, <span style="color: #BFEBBF;">arguments</span>);   }
<span style="color: #F0DFAF; font-weight: bold;">function</span> <span style="color: #93E0E3;">table</span>() { <span style="color: #F0DFAF; font-weight: bold;">return</span> element(<span style="color: #CC9393;">"table"</span>, <span style="color: #BFEBBF;">arguments</span>); }
<span style="color: #F0DFAF; font-weight: bold;">function</span> <span style="color: #93E0E3;">tbody</span>() { <span style="color: #F0DFAF; font-weight: bold;">return</span> element(<span style="color: #CC9393;">"tbody"</span>, <span style="color: #BFEBBF;">arguments</span>); }
<span style="color: #F0DFAF; font-weight: bold;">function</span> <span style="color: #93E0E3;">tr</span>()    { <span style="color: #F0DFAF; font-weight: bold;">return</span> element(<span style="color: #CC9393;">"tr"</span>, <span style="color: #BFEBBF;">arguments</span>);    }
<span style="color: #F0DFAF; font-weight: bold;">function</span> <span style="color: #93E0E3;">td</span>()    { <span style="color: #F0DFAF; font-weight: bold;">return</span> element(<span style="color: #CC9393;">"td"</span>, <span style="color: #BFEBBF;">arguments</span>);    }
<span style="color: #F0DFAF; font-weight: bold;">function</span> <span style="color: #93E0E3;">span</span>()  { <span style="color: #F0DFAF; font-weight: bold;">return</span> element(<span style="color: #CC9393;">"span"</span>, <span style="color: #BFEBBF;">arguments</span>);  }
<span style="color: #F0DFAF; font-weight: bold;">function</span> <span style="color: #93E0E3;">withAttribute</span>(<span style="color: #DFAF8F;">element</span>, <span style="color: #DFAF8F;">attr</span>, <span style="color: #DFAF8F;">value</span>) {
    element.setAttribute(attr, value);
    <span style="color: #F0DFAF; font-weight: bold;">return</span> element;
}
<span style="color: #F0DFAF; font-weight: bold;">function</span> <span style="color: #93E0E3;">withClassname</span>(<span style="color: #DFAF8F;">element</span>, <span style="color: #DFAF8F;">cls</span>) {
    <span style="color: #F0DFAF; font-weight: bold;">return</span> withAttribute(element, <span style="color: #CC9393;">"class"</span>, cls);
}
<span style="color: #F0DFAF; font-weight: bold;">function</span> <span style="color: #93E0E3;">withMouseMoveListener</span>(<span style="color: #DFAF8F;">element</span>, <span style="color: #DFAF8F;">listener</span>) {
    element.onmouseover = listener;
    <span style="color: #F0DFAF; font-weight: bold;">return</span> element;
}
<span style="color: #F0DFAF; font-weight: bold;">function</span> <span style="color: #93E0E3;">slider</span>() {
    <span style="color: #F0DFAF; font-weight: bold;">return</span> withAttribute(
        withAttribute(element(<span style="color: #CC9393;">"input"</span>), <span style="color: #CC9393;">"type"</span>, <span style="color: #CC9393;">"range"</span>),
        <span style="color: #CC9393;">"min"</span>, <span style="color: #CC9393;">"0"</span>);
}


<span style="color: #F0DFAF; font-weight: bold;">function</span> <span style="color: #93E0E3;">makeSudokuBoard</span>() {
    <span style="color: #F0DFAF; font-weight: bold;">var</span> <span style="color: #DFAF8F;">i</span>, <span style="color: #DFAF8F;">j</span>, <span style="color: #DFAF8F;">board</span> = tbody();
    <span style="color: #F0DFAF; font-weight: bold;">for</span> (i = 0; i &lt; 9; i++) {
        <span style="color: #F0DFAF; font-weight: bold;">var</span> <span style="color: #DFAF8F;">row</span> = tr();
        <span style="color: #F0DFAF; font-weight: bold;">for</span> (j = 0; j &lt; 9; j++) {
            <span style="color: #F0DFAF; font-weight: bold;">var</span> <span style="color: #DFAF8F;">cell</span> = withClassname(td(), <span style="color: #CC9393;">"r"</span> + i + <span style="color: #CC9393;">" c"</span> + j + <span style="color: #CC9393;">" g"</span> + (Math.floor(i/3)*3 + Math.floor(j/3)));
            row.appendChild(cell);
        }
        board.appendChild(row);
    }
    <span style="color: #F0DFAF; font-weight: bold;">return</span> withClassname(table(board), <span style="color: #CC9393;">"sudokuBoard"</span>);
}

<span style="color: #F0DFAF; font-weight: bold;">function</span> <span style="color: #93E0E3;">clearBoard</span>(<span style="color: #DFAF8F;">board</span>) {
    <span style="color: #F0DFAF; font-weight: bold;">var</span> <span style="color: #DFAF8F;">i</span>, <span style="color: #DFAF8F;">cells</span> = board.querySelectorAll(<span style="color: #CC9393;">"td"</span>);
    <span style="color: #F0DFAF; font-weight: bold;">for</span> (i = 0; i &lt; cells.length; i++) {
        <span style="color: #F0DFAF; font-weight: bold;">var</span> <span style="color: #DFAF8F;">cell</span> = cells[i];
        cell.innerHTML = <span style="color: #CC9393;">""</span>;
    }

}

<span style="color: #F0DFAF; font-weight: bold;">function</span> <span style="color: #93E0E3;">setBoardFromString</span>(<span style="color: #DFAF8F;">board</span>, <span style="color: #DFAF8F;">strings</span>, <span style="color: #DFAF8F;">additionalStyle</span>) {
    <span style="color: #F0DFAF; font-weight: bold;">var</span> <span style="color: #DFAF8F;">i</span>, <span style="color: #DFAF8F;">j</span>;
    <span style="color: #F0DFAF; font-weight: bold;">for</span> (i = 0; i &lt; 9; i++) {
        <span style="color: #F0DFAF; font-weight: bold;">for</span> (j = 0; j &lt; 9; j++) {
            <span style="color: #F0DFAF; font-weight: bold;">var</span> <span style="color: #DFAF8F;">curValue</span> = strings[i].charAt(j);
            <span style="color: #F0DFAF; font-weight: bold;">if</span> (curValue &amp;&amp; curValue !== <span style="color: #CC9393;">'.'</span>) {
                <span style="color: #F0DFAF; font-weight: bold;">var</span> <span style="color: #DFAF8F;">cell</span> = board.querySelector(<span style="color: #CC9393;">"td.r"</span>+i+<span style="color: #CC9393;">".c"</span>+j);
                cell.innerHTML = <span style="color: #CC9393;">""</span>;
                cell.appendChild(document.createTextNode(curValue));

                <span style="color: #F0DFAF; font-weight: bold;">if</span> (cell.className.indexOf(additionalStyle) === -1)
                    cell.className += <span style="color: #CC9393;">" "</span> + additionalStyle;
            }
        }
    }
}

<span style="color: #F0DFAF; font-weight: bold;">function</span> <span style="color: #93E0E3;">parseAndReplaceWithBoard</span>(<span style="color: #DFAF8F;">divId</span>, <span style="color: #DFAF8F;">solve</span>) {
    <span style="color: #F0DFAF; font-weight: bold;">var</span> <span style="color: #DFAF8F;">divEl</span> = document.getElementById(divId),
        data = divEl.innerHTML.trim(),
        board = makeSudokuBoard(),
        solutions,
        sliderEl = slider(),
        progressHeaderEl = div();

    divEl.innerHTML = <span style="color: #CC9393;">""</span>;
    setBoardFromString(board, data.split(<span style="color: #CC9393;">"\n"</span>), <span style="color: #CC9393;">"given"</span>);

    <span style="color: #F0DFAF; font-weight: bold;">if</span> (solve) {
        solutions = dlxSudokuSolver(data.split(<span style="color: #CC9393;">"\n"</span>), <span style="color: #BFEBBF;">true</span>);
        sliderEl.setAttribute(<span style="color: #CC9393;">"max"</span>, solutions.length-1);
        sliderEl.setAttribute(<span style="color: #CC9393;">"value"</span>, 0);
        divEl.appendChild(progressHeaderEl);
        divEl.appendChild(board);
        divEl.appendChild(sliderEl);
        progressHeaderEl.innerHTML = sliderEl.value+<span style="color: #CC9393;">" / "</span>+(solutions.length - 1);
        sliderEl.oninput = <span style="color: #F0DFAF; font-weight: bold;">function</span>() {
            progressHeaderEl.innerHTML = sliderEl.value+<span style="color: #CC9393;">" / "</span>+(solutions.length-1);
            clearCells(board, <span style="color: #CC9393;">"solution"</span>);
            setBoardFromString(board, toSudokuStrings(solutions[sliderEl.value]), <span style="color: #CC9393;">"solution"</span>);
        }
    } <span style="color: #F0DFAF; font-weight: bold;">else</span> {
        divEl.appendChild(board);
    }
}

<span style="color: #F0DFAF; font-weight: bold;">function</span> <span style="color: #93E0E3;">clearCells</span>(<span style="color: #DFAF8F;">board</span>, <span style="color: #DFAF8F;">style</span>) {
    <span style="color: #F0DFAF; font-weight: bold;">var</span> <span style="color: #DFAF8F;">cells</span> = board.querySelectorAll(<span style="color: #CC9393;">"."</span> + style),
        i;
    <span style="color: #F0DFAF; font-weight: bold;">for</span> (i = 0; i &lt; cells.length; i++) {
        cells[i].innerHTML = <span style="color: #CC9393;">""</span>;
    }
}
<span style="color: #F0DFAF; font-weight: bold;">function</span> <span style="color: #93E0E3;">toSudokuStrings</span>(<span style="color: #DFAF8F;">solution</span>) {
    <span style="color: #F0DFAF; font-weight: bold;">var</span> <span style="color: #DFAF8F;">positions</span> = [], <span style="color: #DFAF8F;">i</span>, <span style="color: #DFAF8F;">j</span>, <span style="color: #DFAF8F;">k</span>, <span style="color: #DFAF8F;">d</span>;
    <span style="color: #F0DFAF; font-weight: bold;">for</span> (i = 0; i &lt; 9; i++) {
        positions[i] = [<span style="color: #CC9393;">'.'</span>, <span style="color: #CC9393;">'.'</span>, <span style="color: #CC9393;">'.'</span>,<span style="color: #CC9393;">'.'</span>, <span style="color: #CC9393;">'.'</span>, <span style="color: #CC9393;">'.'</span>,<span style="color: #CC9393;">'.'</span>, <span style="color: #CC9393;">'.'</span>, <span style="color: #CC9393;">'.'</span>];
    }

    <span style="color: #F0DFAF; font-weight: bold;">for</span> (i = 0; i &lt; solution.length; i++) {
        <span style="color: #F0DFAF; font-weight: bold;">var</span> <span style="color: #DFAF8F;">position</span> = <span style="color: #CC9393;">/p(\d)(\d)/</span>.exec(solution[i]);
        d = parseInt(<span style="color: #CC9393;">/r\d(\d)/</span>.exec(solution[i])[1]) + 1;
        j = position[1];
        k = position[2];
        positions[j][k] = d;
    }
    <span style="color: #F0DFAF; font-weight: bold;">return</span> positions.map(<span style="color: #F0DFAF; font-weight: bold;">function</span>(<span style="color: #DFAF8F;">v</span>) {<span style="color: #F0DFAF; font-weight: bold;">return</span> v.join(<span style="color: #CC9393;">""</span>);});;
}
</pre>
</div>

<script type="text/javascript" src="sudokuBoards.js"></script>
<script type="text/javascript" src="dlxSudokuSolver.js"></script>
<script>
     parseAndReplaceWithBoard("figure1");
     parseAndReplaceWithBoard("figure2", true);
</script>
</div>
</div>
